//
//  ViewController.m
//  speachEx
//
//  Created by Michael-Nine on 2016/10/1.
//  Copyright © 2016年 Michael. All rights reserved.
//

#import "ViewController.h"
#import "HZYSpeach.h"
@interface ViewController ()
@property (strong, nonatomic) HZYSpeach *speech;

@end

@implementation ViewController

- (void)viewDidLoad {
    [super viewDidLoad];
    
}

- (void)touchesBegan:(NSSet<UITouch *> *)touches withEvent:(UIEvent *)event{
    
}
- (IBAction)play:(id)sender {
    self.speech = [HZYSpeach new];
    [_speech speak:@"那时节城墙上已经落满了雪，西风时不时还扬起几粒细沙似雪粉，在空中被凝成冰雨，又坠落下来。匈人的马队大多已经进了城，还有那没有进城的，也扎下帐篷，升起的烟火缕缕飘摇，如同无数条黑蛇，缠绕在银白色的城上，绵延不绝。一身覆雪黑袍，右贤王踏着碎雪的步子，径往大殿上走去，腰上弯刀少了鞘，映在雪阶上，寒得彻骨。数十张黑袍紧随其后，颔首默然，冷得透心。沿途的卫士，既没有勇气上前阻拦，却也不敢擅离职守，听着雪花被马靴踩成粉末的声音，目送匈人们踏进大殿。王上远远看到右贤王，早让众贵戚侍立两旁，自己从殿上迎了下来，“右贤王来也不通知小国主我一声，叫我等这迎来甚不周到。”右贤王见他来迎，也不搭话，只叫侍从们守在殿门处，自己径往殿内去，任由两旁贵戚们纷纷行礼相迎，却也不看一眼。殿上不设王座，楼兰王引右贤王入首席东向坐定，自己退到首席西向对坐，立时又转头看到殿门处黑袍侍从们，“哎呀呀真是罪过，怎么能叫客人站着！”赶紧朝下首各座的贵戚们喊道，“白堆侄儿，你们几个傻坐着干嘛，赶紧给客人让地方啊！整天呆头呆脑的，偌大的基业都毁在你们手里了。”说话间侍女们早就开始从首席起往下添盏满酒，烟袖缕缕，掩映美幻，却不见有一人看一眼添酒人，尝一口夜光杯。这唤作白堆的青年并众人纷纷起身要请黑袍侍从们入座，匈人们看也不看他们一眼，好不尴尬。“都坐吧，”右贤王言如军令，众人霎时齐整整尽往下席依次坐定，大多自顾自端起酒来便饮，也有几个人却还拿手还按着弯刀。盯着众人安排妥当，楼兰王又瞧瞧殿外的飞雪，皱起眉头来跟右贤王说道，“这寒天冻地，大殿也没比外面暖和，右贤王您难得来我这小庙，待在这可是太担待了。”转脸又笑道，“大家不若随小王我到王宫里，正好秋末新酿的葡萄酒，再烤上几十只肥羊，燕歌宴舞大家好好乐一乐。”右贤王听罢一语不发，只是手倚着脸颊轻笑几声，笑罢霎时色变，猛然起身一脚就将那桌席踹翻在地，摔得那杯盘碎成片瓦，惊得那在座冷汗侵背。右贤王却又变色，微笑几声，缓步在殿内行走，好不从容，一殿之内，一时噤声，侍女们抱着酒壶拳坐在一边，不敢动弹，只余着殿外雪语风声。“王上，你不曾料到入了冬，我还会来。”“不曾料到，”被这一惊，楼兰王反倒有些镇静，“小国接待多有不周，右贤王一定不要动怒啊。”“王上！你可知我为何而来？”“这，”楼兰王一时紧张起来，“还望右贤王明示。”听到这话，右贤王大踏步朝上首楼兰王处走去，扬起黑袍垂尾卷地，窸窸窣窣。只一瞬，白光晃眼，刀起刀落将那白刃深深劈进首席里，俯身盯着楼兰王大吼道，“因为我匈人最恨尔背信弃义之徒！”这一吼似乎要吞噬一切，余音萦绕如雪，久久在殿中不能散去。“右贤王息怒。”大约懵了片刻，楼兰王立即回过神来，翻身便拜，“绝无背信弃义之事，还望右贤王明察。”不觉浑身发冷。“你与那汉人暗通是何居心？”“绝无暗通之事，这是有人污蔑小王我！汉军势大，曾有往来，小国兵微将寡，哪能抵挡，被逼无奈才有所接洽，供给些许粮食向导，作他汉庭周转。小王我实属被逼无奈，若是不为了这一方黎民百姓，纵然汉军刀架在小王我脖子上，我也不敢对右贤王有一丝一毫背信弃义。”右贤王缓缓收起刀来，转身坐回到首席楼兰王对面，笑着说道，这天寒地冻的，王上连杯酒都不招待，真是久坐居城，不知道我们匈人苦寒。”说吧哈哈笑着。“酒，酒，酒！”从楼兰王往下贵族外戚们接相呼应，胆小的侍女站不起身来，有那胆大的提起神来去收拾狼藉，添酒加盏，却也不敢看右贤王一眼。“王上，”右贤王喝了酒，脸上莫名开朗，直叫众人又松了一口气，“你可记得月支人？”“记得。”“西域三十六国，月支人独不肯归顺我匈人西庭，跑到八千里外西海上，最后还是被先单于西庭追兵杀了个干干净净。”“月支人不识好歹，死有余辜。”楼兰王紧下了定义。“王上可跑得赢月支人？”“右贤王说笑了。”“王上可还记得跟我西庭的盟约。”右贤王只轻轻抿了抿酒杯，并不一饮而尽，大不似匈人风气，“我记不清了，你跟我讲讲是了。”“如此小事，怎劳右贤王惦记，”楼兰王赶紧答道，“西庭盟约讲定，秋末冬前，楼兰送铁两千斤，布三千匹，栗谷两万担，马一千匹，牛羊两千头，弓木三千株，美酒五千桶，所订一切，定时抵达西庭，今年小王可是一早就差人送去了。”“先单于常说，经营西域如同牧羊，吃肉剪毛都要按时节，不可以做尽了。所以我西庭往来，在汉地纵兵烧杀，对你等却是秋毫无犯，并非出于怜悯，乃是把西域诸国当做我西庭自家兄弟。”“右贤王明辨是非，乃是诸国之福。”右贤王听后不由一笑，举杯高呼，“祝王上！”“祝右贤王，”众人赶紧跟着楼兰王相迎道，“西庭之狼，雪山之鹰。”"];
}
- (IBAction)pause:(id)sender {
    [self.speech pause];
}
- (IBAction)continu:(id)sender {
    [self.speech replay];
}

- (void)didReceiveMemoryWarning {
    [super didReceiveMemoryWarning];
    // Dispose of any resources that can be recreated.
}


@end
